{"id":1664,"date":"2019-08-29T08:27:26","date_gmt":"2019-08-29T08:27:26","guid":{"rendered":"https:\/\/ehrbase.org\/?page_id=1664"},"modified":"2019-10-17T12:59:44","modified_gmt":"2019-10-17T12:59:44","slug":"code-of-conduct","status":"publish","type":"page","link":"https:\/\/ehrbase.org\/code-of-conduct\/","title":{"rendered":"Code of Conduct"},"content":{"rendered":"\n<p style=\"font-size:0\"><\/p>\n\n\n\n<p>As an open community, we wholeheartedly follow the specific guidelines of the Code of Conduct (CoC) as defined by the <a href=\"https:\/\/www.apache.org\/foundation\/policies\/conduct.html\">Apache Foundation<\/a>. Here you find a copy with some smaller adjustments. The CoC applies to all communication spaces managed by the EHRbase Community, including mailinglists, issue trackers, wikis, blogs etc.   <\/p>\n\n\n\n<p>While a CoC can never be complete, we believe the one made by the Apache Foundation provides a thorough understanding of how people can work together in a polite, friendly and productive environment. The following is a copy of the guidelines:<\/p>\n\n\n\n<h2 id=\"specific-guidelines\">Specific Guidelines<\/h2>\n\n\n\n<p>We strive to:<\/p>\n\n\n\n<ol><li><strong>Be open.<\/strong>&nbsp;We invite anyone to participate in our community. We preferably use public methods of communication for project-related messages, unless discussing something sensitive. This applies to messages for help or project-related support, too; not only is a public support request much more likely to result in an answer to a question, it also makes sure that any inadvertent mistakes made by people answering will be more easily detected and corrected.<\/li><li><strong>Be&nbsp;empathetic, welcoming, friendly, and patient.<\/strong>&nbsp;We work together to resolve conflict, assume good intentions, and do our best to act in an empathetic fashion. We may all experience some frustration from time to time, but we do not allow frustration to turn into a personal attack. A community where people feel uncomfortable or threatened is not a productive one. We should be respectful when dealing with other community members as well as with people outside our community.<\/li><li><strong>Be collaborative.<\/strong>&nbsp;Our work will be used by other people, and in turn we will depend on the work of others. When we make something for the benefit of the project, we are willing to explain to others how it works, so that they can build on the work to make it even better. Any decision we make will affect users and colleagues, and we take those consequences seriously when making decisions.<\/li><li><strong>Be inquisitive.<\/strong>&nbsp;Nobody knows everything! Asking questions early avoids many problems later, so questions are encouraged, though they may be directed to the appropriate forum. Those who are asked should be responsive and helpful, within the context of our shared goal of improving the EHRbase project code.<\/li><li><strong>Be careful in the words that we choose.<\/strong>&nbsp;Whether we are participating as professionals or volunteers, we value professionalism in all interactions, and take responsibility for our own speech. Be kind to others. Do not insult or put down other participants. Harassment and other exclusionary behaviour are not acceptable. This includes, but is not limited to:<ul><li>Violent threats or language directed against another person.<\/li><li>Sexist, racist, or otherwise discriminatory jokes and language.<\/li><li>Posting sexually explicit or violent material.<\/li><li>Posting (or threatening to post) other people&#8217;s personally identifying information (&#8220;doxing&#8221;).<\/li><li>Sharing private content, such as emails sent privately or non-publicly, or unlogged forums such as IRC channel history.<\/li><li>Personal insults, especially those using racist or sexist terms.<\/li><li>Unwelcome sexual attention.<\/li><li>Excessive or unnecessary profanity.<\/li><li>Repeated harassment of others. In general, if someone asks you to stop, then stop.<\/li><li>Advocating for, or encouraging, any of the above behaviour.<\/li><\/ul><\/li><li><strong>Be concise.<\/strong>&nbsp;Keep in mind that what you write once will be read by hundreds of persons. Writing a short email means people can understand the conversation as efficiently as possible. Short emails should always strive to be empathetic, welcoming, friendly and patient. When a long explanation is necessary, consider adding a summary.Try to bring new ideas to a conversation so that each mail adds something unique to the thread, keeping in mind that the rest of the thread still contains the other messages with arguments that have already been made.Try to stay on topic, especially in discussions that are already fairly large.<\/li><li><strong>Step down considerately.<\/strong>&nbsp;Members of every project come and go. When somebody leaves or disengages from the project they should tell people they are leaving and take the proper steps to ensure that others can pick up where they left off. In doing so, they should remain respectful of those who continue to participate in the project and should not misrepresent the project&#8217;s goals or achievements. Likewise, community members should respect any individual&#8217;s choice to leave the project.<\/li><\/ol>\n\n\n\n<h2 id=\"diversity-statement\">Diversity Statement<\/h2>\n\n\n\n<p>The EHRbase Community welcomes and encourages participation by everyone. We are committed to being a community that everyone feels good about joining. Although we may not be able to satisfy everyone, we will always work to treat everyone well.<\/p>\n\n\n\n<p>No matter how you identify yourself or how others perceive you: we welcome you. Though no list can hope to be comprehensive, we explicitly honour diversity in: age, culture, ethnicity, genotype, gender identity or expression, language, national origin, neurotype, phenotype, political beliefs, profession, race, religion, sexual orientation, socioeconomic status, subculture and technical ability.<\/p>\n\n\n\n<p>Though we welcome people fluent in all languages, EHRbase development is conducted in English.<\/p>\n\n\n\n<p>Standards for behaviour in the EHRbase community are detailed in the Code of Conduct above. We expect participants in our community to meet these standards in all their interactions and to help others to do so as well.<\/p>\n\n\n\n<h2 id=\"reporting-guidelines\">Reporting Guidelines<\/h2>\n\n\n\n<p>While this code of conduct should be adhered to by participants, we recognize that sometimes people may have a bad day, or be unaware of some of the guidelines in this code of conduct. When that happens, you may reply to them and point out this code of conduct. Such messages may be in public or in private, whatever is most appropriate. However, regardless of whether the message is public or not, it should still adhere to the relevant parts of this code of conduct; in particular, it should not be abusive or disrespectful.<\/p>\n\n\n\n<p>If you believe someone is violating this code of conduct, you may reply to them and point out this code of conduct. Such messages may be in public or in private, whatever is most appropriate. Assume good faith; it is more likely that participants are unaware of their bad behaviour than that they intentionally try to degrade the quality of the discussion. Should there be difficulties in dealing with the situation, you may report your compliance issues in confidence to:<\/p>\n\n\n\n<ul><li>birger.haarbrandt@plri.de<\/li><\/ul>\n\n\n\n<p>If the violation is in documentation or code, for example inappropriate pronoun usage or word choice within official documentation, we ask that people report these privately to  private@<em>ehrbase<\/em>.org, and, if they have sufficient ability within the project, to resolve or remove the concerning material, being mindful of the perspective of the person originally reporting the issue.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As an open community, we wholeheartedly follow the specific guidelines of the Code of Conduct (CoC) as defined by the Apache Foundation. Here you find a copy with some smaller &#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"template-left-sidebar.php","meta":[],"_links":{"self":[{"href":"https:\/\/ehrbase.org\/wp-json\/wp\/v2\/pages\/1664"}],"collection":[{"href":"https:\/\/ehrbase.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/ehrbase.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/ehrbase.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ehrbase.org\/wp-json\/wp\/v2\/comments?post=1664"}],"version-history":[{"count":9,"href":"https:\/\/ehrbase.org\/wp-json\/wp\/v2\/pages\/1664\/revisions"}],"predecessor-version":[{"id":1814,"href":"https:\/\/ehrbase.org\/wp-json\/wp\/v2\/pages\/1664\/revisions\/1814"}],"wp:attachment":[{"href":"https:\/\/ehrbase.org\/wp-json\/wp\/v2\/media?parent=1664"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}